{"config": [{"config": {"function_type": "lambda", "output_shape_type": "raw", "arguments": {}, "trainable": true, "batch_input_shape": [null, 32, 64, 3], "output_shape": null, "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-9-67a92ca9d87c>\u00da\b<lambda>\u0004\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1"}, "class_name": "Lambda"}, {"config": {"cropping": [[13, 4], [0, 0]], "batch_input_shape": [null, 32, 64, 3], "input_dtype": "float32", "trainable": true, "name": "cropping2d_1"}, "class_name": "Cropping2D"}, {"config": {"nb_filter": 24, "b_constraint": null, "subsample": [2, 2], "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "bias": true, "border_mode": "valid", "nb_col": 5, "activation": "relu", "trainable": true, "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "name": "convolution2d_1"}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 64, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "bias": true, "border_mode": "valid", "nb_col": 3, "activation": "relu", "trainable": true, "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_2"}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 64, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "bias": true, "border_mode": "valid", "nb_col": 3, "activation": "relu", "trainable": true, "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_3"}, "class_name": "Convolution2D"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"nb_filter": 128, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "bias": true, "border_mode": "same", "nb_col": 3, "activation": "relu", "trainable": true, "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_4"}, "class_name": "Convolution2D"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"border_mode": "valid", "strides": [2, 2], "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "output_dim": 100, "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "bias": true, "activation": "linear", "b_constraint": null, "b_regularizer": null, "input_dim": 1664, "activity_regularizer": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"trainable": true, "output_dim": 10, "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "bias": true, "activation": "linear", "b_constraint": null, "b_regularizer": null, "input_dim": 100, "activity_regularizer": null, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"trainable": true, "output_dim": 1, "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "bias": true, "activation": "linear", "b_constraint": null, "b_regularizer": null, "input_dim": 10, "activity_regularizer": null, "name": "dense_3"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}